{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature report listing updates to the Skills page and navigation labels with associated files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables with light/dark theme tokens and global resets.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the root React app.",
  "frontend/src/App.tsx": "Root component rendering the animated background and the centered BookNavigator.",
  "frontend/src/components/background/AnimatedBackground.tsx": "Renders layered warm gradient, animated overlay, and grain texture respecting reduced-motion preference.",
  "frontend/src/components/book/BookNavigationContext.tsx": "Provides React context for navigating to specific portfolio pages.",
  "frontend/src/components/book/BookNavigator.tsx": "Manages page spreads, navigation, flip animations, keyboard controls, and layout switching.",
  "frontend/src/components/book/PageFlipLayer.tsx": "Visual layer rendering the directional page-flip animation.",
  "frontend/src/components/book/PaginationIndicator.tsx": "Displays current and total page counts in a styled badge.",
  "frontend/src/components/book/useBookLayout.ts": "Hook detecting viewport width to switch between single and double page layouts.",
  "frontend/src/features/portfolio/pages/AboutPage.tsx": "Editorial about page detailing background, philosophy, and experience.",
  "frontend/src/features/portfolio/pages/ContactPage.tsx": "Contact page with email, location, and social links presented in two-column layout.",
  "frontend/src/features/portfolio/pages/CoverPage.tsx": "Renders the portfolio cover with name, portrait image, and brief academic info.",
  "frontend/src/features/portfolio/pages/ProjectPage.tsx": "Displays a featured project page with title, description, role, tech stack, and an image placeholder.",
  "frontend/src/features/portfolio/pages/SkillsServicesPage.tsx": "Shows lists of programming languages, built projects, and extra skills.",
  "frontend/src/features/portfolio/pages/TableOfContentsPage.tsx": "Generates a navigable table of contents for portfolio pages using book navigation context.",
  "frontend/src/features/portfolio/portfolioPages.tsx": "Defines the ordered list of portfolio pages and their components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity authentication and state management.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that returns whether the user prefers reduced motion based on media query.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for future backend queries.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for the editorial UI theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme options using CSS variables.",
  "project_state.json": "Tracks project state for updating the Skills page, including requirements, feature updates, and pending requests."
}