{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report mapping two cover‑related features to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of all frontend files with brief explanations of their purpose.",
  "frontend/index.css": "Tailwind base and custom OKLCH theme variables for light/dark modes with global styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Root React component rendering the animated background and book navigator.",
  "frontend/src/components/background/AnimatedBackground.tsx": "Full‑screen layered gradient and grain background with reduced‑motion support.",
  "frontend/src/components/book/BookNavigator.tsx": "Controls page navigation, layout mode, and flip animations for the portfolio book.",
  "frontend/src/components/book/PageFlipLayer.tsx": "Renders the animated page‑flip overlay based on direction.",
  "frontend/src/components/book/PaginationIndicator.tsx": "Shows current spread number in a small fixed badge.",
  "frontend/src/components/book/useBookLayout.ts": "Hook that switches between single and double page layouts based on viewport width.",
  "frontend/src/features/portfolio/pages/AboutPage.tsx": "Editorial two‑column About page with background, philosophy, and experience sections.",
  "frontend/src/features/portfolio/pages/ContactPage.tsx": "Two‑column contact page with email, location, and social links.",
  "frontend/src/features/portfolio/pages/CoverPage.tsx": "Renders the portfolio cover with a portrait, title, and basic personal details.",
  "frontend/src/features/portfolio/pages/ProjectPage.tsx": "Displays a project with title, image placeholder, description, role, and tech stack.",
  "frontend/src/features/portfolio/pages/SkillsServicesPage.tsx": "Shows categorized skills and a list of offered services using static arrays.",
  "frontend/src/features/portfolio/pages/TableOfContentsPage.tsx": "Generates a table of contents by listing portfolio pages beyond the first two.",
  "frontend/src/features/portfolio/portfolioPages.tsx": "Defines the ordered list of portfolio pages and their associated React components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting the user's reduced-motion preference via media query.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for future backend React Query integrations.",
  "frontend/src/index.css": "Tailwind setup with extensive CSS variables and editorial-themed styling for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClient and InternetIdentityProvider before rendering the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, shadows, animations, and plugins tailored to an editorial aesthetic.",
  "project_state.json": "Stores the project’s current state, including features, requirements, and visual/functional goals for the portfolio site."
}