{
  "kind": "build_request",
  "title": "Add Quant Insider Market Making Challenge to About Me > Experience hackathons list",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In `frontend/src/features/portfolio/pages/AboutPage.tsx`, add a new 5th hackathon entry to the `hackathons` array for: \"Market Making Challenge organized by Quant Insider and Fintech Club, IIT ISM Dhanbad\" (listed under \"Quant Insider\"). Preserve the existing rendering style used for other hackathon entries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ok so in this in the about me page in experience section add the names of the following hackathon 5.  Quant Insider\nMarket Making Challenge organized by Quant Insider and\nFintech Club, IIT ISM Dhanbad"
        ]
      },
      "acceptanceCriteria": [
        "The Hackathons list on the About Me page displays the new entry: \"Market Making Challenge organized by Quant Insider and Fintech Club, IIT ISM Dhanbad\".",
        "The new entry is included as an additional item (now 5 total hackathon items) without removing or renaming existing entries.",
        "The new entry uses the same typography, spacing, and list styling as the other hackathon items.",
        "The code builds successfully with TypeScript with no runtime errors on the About Me page."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files in `frontend/src/components/ui` or the immutable hook files listed in `frontend.immutablePaths`.",
    "Keep all changes scoped to updating the hackathons list in `frontend/src/features/portfolio/pages/AboutPage.tsx`. No backend changes."
  ],
  "nonGoals": [
    "Adding or changing certificate image/PDF assets for the new hackathon entry (no certificate URL was provided).",
    "Changing page layout, navigation, or styling beyond what is required to show the new hackathon name."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}